"""
Вам дан шаблон main.py, в шаблоне объявлены две функции "parse_parameters" и "parse_cookies" (шаблоны).
Необходимо реализовать функционал данных функций и написать по 10 тестов к каждой из функций, в шаблоне,
в качестве примера, уже написано по два теста на каждую функцию.


Функция "parse_parameters" должна принимать строку запроса и извлекать (парсить) из нее переданные параметры, результат
 возвращать в виде словаря


Функция "parse_cookies" должна принимать строку куков и извлекать (парсить) из нее куки,
результат возвращать в виде словаря
"""

def parse_parameters(query: str) -> dict:
    return {}

def parse_cookies(query: str) -> dict:
    return {}

if __name__ == '__main__':
